tests/ycsb/results/bw_bench_20260417_001923/phase3_sustain.txt
/usr/bin/java  -classpath /tmp/redis-cxl-bench-8079/tests/ycsb/ycsb-0.17.0/conf:/tmp/redis-cxl-bench-8079/tests/ycsb/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/tmp/redis-cxl-bench-8079/tests/ycsb/ycsb-0.17.0/lib/core-0.17.0.jar:/tmp/redis-cxl-bench-8079/tests/ycsb/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/tmp/redis-cxl-bench-8079/tests/ycsb/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/tmp/redis-cxl-bench-8079/tests/ycsb/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/tmp/redis-cxl-bench-8079/tests/ycsb/ycsb-0.17.0/redis-binding/lib/commons-pool2-2.4.2.jar:/tmp/redis-cxl-bench-8079/tests/ycsb/ycsb-0.17.0/redis-binding/lib/jedis-2.9.0.jar:/tmp/redis-cxl-bench-8079/tests/ycsb/ycsb-0.17.0/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -s -P /tmp/redis-cxl-bench-8079/tests/ycsb/workloads/workload_bw_saturate -p operationcount=3000000 -p threadcount=48 -p readproportion=0.3 -p updateproportion=0.6 -p insertproportion=0.1 -p redis.host=127.0.0.1 -p redis.port=6379
Command line: -t -db site.ycsb.db.RedisClient -s -P /tmp/redis-cxl-bench-8079/tests/ycsb/workloads/workload_bw_saturate -p operationcount=3000000 -p threadcount=48 -p readproportion=0.3 -p updateproportion=0.6 -p insertproportion=0.1 -p redis.host=127.0.0.1 -p redis.port=6379
YCSB Client 0.17.0

Loading workload...
Starting test.
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2026-04-17 00:26:01:104 0 sec: 0 operations; est completion in 0 second 
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2026-04-17 00:26:10:959 10 sec: 52154 operations; 5214.88 current ops/sec; est completion in 9 minutes [READ: Count=6341, Max=199551, Min=168, Avg=7645.43, 90=11719, 99=28927, 99.9=54175, 99.99=192383] [READ-FAILED: Count=9419, Max=202367, Min=305, Avg=7618.61, 90=12007, 99=28591, 99.9=64671, 99.99=181887] [UPDATE: Count=31401, Max=200831, Min=343, Avg=8443.53, 90=12935, 99=34367, 99.9=148991, 99.99=188927] [INSERT: Count=5145, Max=192767, Min=2007, Avg=16031.9, 90=24895, 99=53567, 99.9=76095, 99.99=162687] 
2026-04-17 00:26:20:959 20 sec: 110503 operations; 5834.32 current ops/sec; est completion in 8 minutes [READ: Count=7960, Max=67519, Min=148, Avg=7181.1, 90=10631, 99=25983, 99.9=45695, 99.99=55615] [READ-FAILED: Count=9467, Max=68223, Min=67, Avg=7046.32, 90=10319, 99=26159, 99.9=48191, 99.99=67903] [UPDATE: Count=34991, Max=70207, Min=341, Avg=7672.5, 90=11079, 99=27823, 99.9=52191, 99.99=67711] [INSERT: Count=5847, Max=78527, Min=5000, Avg=14649.2, 90=20047, 99=48447, 99.9=62143, 99.99=78271] 
2026-04-17 00:26:30:958 30 sec: 168481 operations; 5798.38 current ops/sec; est completion in 8 minutes [READ: Count=8449, Max=83903, Min=96, Avg=7173.89, 90=10519, 99=29807, 99.9=52287, 99.99=83263] [READ-FAILED: Count=9087, Max=82367, Min=150, Avg=7125.59, 90=10439, 99=29295, 99.9=51871, 99.99=81343] [UPDATE: Count=34879, Max=84223, Min=375, Avg=7726.93, 90=11135, 99=31007, 99.9=56031, 99.99=83263] [INSERT: Count=5611, Max=97215, Min=3372, Avg=15031.31, 90=20959, 99=53727, 99.9=79423, 99.99=90495] 
2026-04-17 00:26:40:957 40 sec: 224506 operations; 5603.06 current ops/sec; est completion in 8 minutes [READ: Count=8645, Max=62143, Min=1465, Avg=7507.16, 90=11279, 99=31423, 99.9=48991, 99.99=61887] [READ-FAILED: Count=8312, Max=65919, Min=86, Avg=7501.07, 90=11263, 99=32335, 99.9=62303, 99.99=62879] [UPDATE: Count=33619, Max=78271, Min=435, Avg=7982.28, 90=11743, 99=34303, 99.9=57247, 99.99=75583] [INSERT: Count=5418, Max=88767, Min=5068, Avg=15455.84, 90=22015, 99=55231, 99.9=78591, 99.99=84671] 
2026-04-17 00:26:50:958 50 sec: 282217 operations; 5771.1 current ops/sec; est completion in 8 minutes [READ: Count=8971, Max=102911, Min=601, Avg=7252.39, 90=10391, 99=28239, 99.9=72575, 99.99=99775] [READ-FAILED: Count=8231, Max=101055, Min=730, Avg=7076.16, 90=10087, 99=27887, 99.9=71423, 99.99=100287] [UPDATE: Count=34666, Max=102335, Min=511, Avg=7723.65, 90=10727, 99=29535, 99.9=76287, 99.99=100607] [INSERT: Count=5869, Max=115007, Min=4664, Avg=15072.91, 90=20255, 99=54207, 99.9=103551, 99.99=112703] 
2026-04-17 00:27:00:969 60 sec: 341484 operations; 5926.11 current ops/sec; est completion in 7 minutes [READ: Count=9508, Max=57887, Min=684, Avg=7008.62, 90=9639, 99=27967, 99.9=49663, 99.99=57887] [READ-FAILED: Count=8259, Max=68735, Min=517, Avg=7027.54, 90=9799, 99=31631, 99.9=51775, 99.99=67263] [UPDATE: Count=35590, Max=69695, Min=394, Avg=7588.14, 90=10407, 99=31247, 99.9=50527, 99.99=68287] [INSERT: Count=5897, Max=76671, Min=1482, Avg=14416.73, 90=18991, 99=52767, 99.9=69439, 99.99=75903] 
2026-04-17 00:27:10:958 70 sec: 401734 operations; 6025 current ops/sec; est completion in 7 minutes [READ: Count=10016, Max=65727, Min=1424, Avg=6963.34, 90=9799, 99=28383, 99.9=54751, 99.99=65279] [READ-FAILED: Count=8059, Max=64639, Min=606, Avg=6744.51, 90=9447, 99=27119, 99.9=48575, 99.99=59103] [UPDATE: Count=36118, Max=67327, Min=591, Avg=7420.67, 90=10279, 99=29151, 99.9=52863, 99.99=64319] [INSERT: Count=6026, Max=73535, Min=2620, Avg=14353.61, 90=19407, 99=51839, 99.9=69311, 99.99=72639] 
2026-04-17 00:27:20:958 80 sec: 460346 operations; 5861.79 current ops/sec; est completion in 7 minutes [READ: Count=10115, Max=75455, Min=96, Avg=7124.8, 90=10295, 99=25791, 99.9=58879, 99.99=75007] [READ-FAILED: Count=7643, Max=72191, Min=902, Avg=7095.18, 90=10231, 99=27663, 99.9=60575, 99.99=70911] [UPDATE: Count=35035, Max=76095, Min=678, Avg=7610.59, 90=10935, 99=26079, 99.9=56703, 99.99=73471] [INSERT: Count=5863, Max=86015, Min=3408, Avg=14785.06, 90=19999, 99=57087, 99.9=79359, 99.99=85695] 
2026-04-17 00:27:30:958 90 sec: 522094 operations; 6174.8 current ops/sec; est completion in 7 minutes [READ: Count=10704, Max=63839, Min=494, Avg=6768.33, 90=9399, 99=28447, 99.9=54527, 99.99=62847] [READ-FAILED: Count=7723, Max=62655, Min=724, Avg=6591.59, 90=9159, 99=29519, 99.9=53343, 99.99=56031] [UPDATE: Count=37102, Max=77503, Min=541, Avg=7267.01, 90=9879, 99=30687, 99.9=53279, 99.99=64351] [INSERT: Count=6179, Max=88255, Min=5684, Avg=13940, 90=17759, 99=52735, 99.9=67903, 99.99=83583] 
2026-04-17 00:27:40:958 100 sec: 584277 operations; 6217.68 current ops/sec; est completion in 6 minutes [READ: Count=11008, Max=76991, Min=1273, Avg=6663.81, 90=9319, 99=28015, 99.9=51615, 99.99=62239] [READ-FAILED: Count=7755, Max=62335, Min=1478, Avg=6695.71, 90=9247, 99=29823, 99.9=57855, 99.99=62303] [UPDATE: Count=37245, Max=77055, Min=1165, Avg=7207.45, 90=9839, 99=29791, 99.9=57311, 99.99=76095] [INSERT: Count=6169, Max=86399, Min=5984, Avg=13910.45, 90=17711, 99=51743, 99.9=69631, 99.99=82623] 
2026-04-17 00:27:50:957 110 sec: 646982 operations; 6270.5 current ops/sec; est completion in 6 minutes [READ: Count=11052, Max=81919, Min=650, Avg=6642.36, 90=9127, 99=26335, 99.9=47167, 99.99=81919] [READ-FAILED: Count=7601, Max=77951, Min=491, Avg=6524.53, 90=9199, 99=24383, 99.9=45759, 99.99=47711] [UPDATE: Count=37876, Max=83007, Min=647, Avg=7156.97, 90=9767, 99=27023, 99.9=47423, 99.99=82495] [INSERT: Count=6163, Max=94463, Min=3618, Avg=13821.66, 90=18223, 99=48863, 99.9=86975, 99.99=94015] 
2026-04-17 00:28:00:957 120 sec: 708126 operations; 6115.01 current ops/sec; est completion in 6 minutes [READ: Count=11115, Max=93823, Min=1280, Avg=6848.77, 90=9887, 99=27119, 99.9=71615, 99.99=76287] [READ-FAILED: Count=7247, Max=75903, Min=83, Avg=6817.1, 90=9759, 99=27887, 99.9=64511, 99.99=73599] [UPDATE: Count=36789, Max=101567, Min=509, Avg=7329.92, 90=10375, 99=28127, 99.9=69119, 99.99=76223] [INSERT: Count=5994, Max=110143, Min=4912, Avg=14075.8, 90=18639, 99=50527, 99.9=81215, 99.99=109951] 
2026-04-17 00:28:10:958 130 sec: 769885 operations; 6175.28 current ops/sec; est completion in 6 minutes [READ: Count=11188, Max=61183, Min=658, Avg=6691.48, 90=9519, 99=27823, 99.9=52383, 99.99=58687] [READ-FAILED: Count=7404, Max=62975, Min=1166, Avg=6770.28, 90=9663, 99=29007, 99.9=52511, 99.99=61919] [UPDATE: Count=36947, Max=65087, Min=419, Avg=7237.88, 90=10087, 99=28895, 99.9=52927, 99.99=62207] [INSERT: Count=6189, Max=72063, Min=2712, Avg=13898.53, 90=18639, 99=49823, 99.9=70271, 99.99=71359] 
2026-04-17 00:28:20:958 140 sec: 829717 operations; 5983.2 current ops/sec; est completion in 6 minutes [READ: Count=10989, Max=76799, Min=1404, Avg=6968.42, 90=10191, 99=27583, 99.9=49631, 99.99=76095] [READ-FAILED: Count=6973, Max=75967, Min=75, Avg=6895.08, 90=10167, 99=26495, 99.9=46783, 99.99=75839] [UPDATE: Count=35960, Max=76927, Min=420, Avg=7522.26, 90=10735, 99=29567, 99.9=54079, 99.99=76671] [INSERT: Count=5942, Max=87295, Min=6056, Avg=14367.36, 90=19503, 99=51103, 99.9=82623, 99.99=87231] 
2026-04-17 00:28:30:957 150 sec: 880249 operations; 5053.71 current ops/sec; est completion in 6 minutes [READ: Count=9382, Max=275199, Min=361, Avg=8257.87, 90=11047, 99=57791, 99.9=127551, 99.99=273407] [READ-FAILED: Count=5770, Max=275455, Min=102, Avg=8218.09, 90=10791, 99=55839, 99.9=138879, 99.99=268031] [UPDATE: Count=30242, Max=277247, Min=571, Avg=8821.44, 90=11695, 99=60863, 99.9=138367, 99.99=269055] [INSERT: Count=5167, Max=308223, Min=6088, Avg=16877.64, 90=20687, 99=106431, 99.9=301311, 99.99=306943] 
2026-04-17 00:28:40:957 160 sec: 945490 operations; 6523.45 current ops/sec; est completion in 5 minutes [READ: Count=12194, Max=124095, Min=149, Avg=6301, 90=8799, 99=17871, 99.9=51167, 99.99=122879] [READ-FAILED: Count=7472, Max=123711, Min=724, Avg=6292.37, 90=8871, 99=18111, 99.9=50975, 99.99=123135] [UPDATE: Count=39041, Max=125055, Min=251, Avg=6893.52, 90=9423, 99=20527, 99.9=60063, 99.99=123967] [INSERT: Count=6520, Max=135679, Min=5288, Avg=13272.63, 90=17007, 99=43295, 99.9=127679, 99.99=135167] 
2026-04-17 00:28:50:957 170 sec: 1001890 operations; 5640 current ops/sec; est completion in 5 minutes [READ: Count=10226, Max=75199, Min=654, Avg=7327.79, 90=10287, 99=30559, 99.9=53055, 99.99=72319] [READ-FAILED: Count=6465, Max=71295, Min=334, Avg=7401.43, 90=10255, 99=34559, 99.9=52831, 99.99=70463] [UPDATE: Count=33947, Max=77695, Min=523, Avg=7899.82, 90=10855, 99=33503, 99.9=57567, 99.99=73727] [INSERT: Count=5787, Max=105791, Min=3138, Avg=15294.46, 90=19551, 99=61247, 99.9=89215, 99.99=99519] 
2026-04-17 00:29:00:958 180 sec: 1064248 operations; 6235.8 current ops/sec; est completion in 5 minutes [READ: Count=11472, Max=128767, Min=881, Avg=6692.43, 90=9455, 99=23887, 99.9=69695, 99.99=128767] [READ-FAILED: Count=7185, Max=128383, Min=801, Avg=6541.41, 90=9295, 99=22815, 99.9=49759, 99.99=128255] [UPDATE: Count=37373, Max=129343, Min=382, Avg=7167.97, 90=10063, 99=24959, 99.9=67263, 99.99=128703] [INSERT: Count=6293, Max=141055, Min=4920, Avg=13945.05, 90=18639, 99=48767, 99.9=133247, 99.99=140671] 
2026-04-17 00:29:10:957 190 sec: 1141743 operations; 7750.28 current ops/sec; est completion in 5 minutes [READ: Count=14423, Max=92735, Min=907, Avg=5363.11, 90=7723, 99=20543, 99.9=44031, 99.99=86975] [READ-FAILED: Count=8908, Max=93311, Min=1045, Avg=5359.46, 90=7719, 99=20463, 99.9=44063, 99.99=92991] [UPDATE: Count=46594, Max=92991, Min=798, Avg=5789.62, 90=8223, 99=21775, 99.9=44127, 99.99=90815] [INSERT: Count=7572, Max=110847, Min=3070, Avg=11176.06, 90=14423, 99=41599, 99.9=95231, 99.99=105599] 
2026-04-17 00:29:20:957 200 sec: 1293083 operations; 15134 current ops/sec; est completion in 4 minutes [READ: Count=27795, Max=54399, Min=52, Avg=2766.32, 90=3599, 99=12071, 99.9=24751, 99.99=53183] [READ-FAILED: Count=17535, Max=54495, Min=49, Avg=2761.16, 90=3583, 99=12079, 99.9=24447, 99.99=53599] [UPDATE: Count=90946, Max=54879, Min=167, Avg=2949.03, 90=3765, 99=13007, 99.9=24527, 99.99=54015] [INSERT: Count=15042, Max=57823, Min=1565, Avg=5715.14, 90=6939, 99=24479, 99.9=50399, 99.99=57567] 
2026-04-17 00:29:30:957 210 sec: 1437966 operations; 14488.3 current ops/sec; est completion in 3 minutes [READ: Count=26348, Max=33855, Min=34, Avg=2878.26, 90=4115, 99=12175, 99.9=23423, 99.99=33343] [READ-FAILED: Count=16889, Max=34399, Min=264, Avg=2869.36, 90=4081, 99=12087, 99.9=24575, 99.99=34335] [UPDATE: Count=87311, Max=34495, Min=144, Avg=3087.57, 90=4395, 99=13319, 99.9=24671, 99.99=34111] [INSERT: Count=14367, Max=48831, Min=1944, Avg=5973.98, 90=8407, 99=24143, 99.9=36607, 99.99=47487] 
2026-04-17 00:29:40:958 220 sec: 1601675 operations; 16369.26 current ops/sec; est completion in 3 minutes [READ: Count=29644, Max=32303, Min=134, Avg=2553.86, 90=3129, 99=10767, 99.9=22479, 99.99=29663] [READ-FAILED: Count=19381, Max=33823, Min=274, Avg=2543.07, 90=3099, 99=10567, 99.9=22239, 99.99=31167] [UPDATE: Count=98361, Max=39743, Min=212, Avg=2731.39, 90=3279, 99=11783, 99.9=22783, 99.99=38943] [INSERT: Count=16286, Max=61215, Min=2116, Avg=5287.88, 90=6023, 99=22095, 99.9=40127, 99.99=48735] 
2026-04-17 00:29:50:957 230 sec: 1757043 operations; 15538.35 current ops/sec; est completion in 2 minutes [READ: Count=28432, Max=33759, Min=44, Avg=2698.39, 90=3521, 99=10831, 99.9=21567, 99.99=27679] [READ-FAILED: Count=18142, Max=33343, Min=35, Avg=2670.47, 90=3461, 99=10927, 99.9=21903, 99.99=27775] [UPDATE: Count=93130, Max=33727, Min=120, Avg=2867.27, 90=3707, 99=11679, 99.9=21919, 99.99=27951] [INSERT: Count=15671, Max=37407, Min=444, Avg=5572.63, 90=6899, 99=22079, 99.9=31279, 99.99=37023] 
2026-04-17 00:30:00:957 240 sec: 1923284 operations; 16624.1 current ops/sec; est completion in 2 minutes [READ: Count=30919, Max=61023, Min=71, Avg=2529.06, 90=3169, 99=10087, 99.9=21871, 99.99=54335] [READ-FAILED: Count=18928, Max=61247, Min=61, Avg=2501.41, 90=3143, 99=9503, 99.9=21327, 99.99=61023] [UPDATE: Count=99835, Max=61567, Min=225, Avg=2687.16, 90=3327, 99=10471, 99.9=22095, 99.99=55519] [INSERT: Count=16583, Max=63647, Min=961, Avg=5180.57, 90=6059, 99=21231, 99.9=31455, 99.99=63615] 
2026-04-17 00:30:10:958 250 sec: 2086283 operations; 16298.27 current ops/sec; est completion in 1 minute [READ: Count=30390, Max=24415, Min=46, Avg=2572.48, 90=3127, 99=11407, 99.9=21919, 99.99=24143] [READ-FAILED: Count=18798, Max=27391, Min=31, Avg=2561.01, 90=3083, 99=11527, 99.9=22575, 99.99=24543] [UPDATE: Count=97452, Max=29567, Min=182, Avg=2737.83, 90=3241, 99=12311, 99.9=22847, 99.99=24623] [INSERT: Count=16345, Max=37183, Min=976, Avg=5306.49, 90=6023, 99=22591, 99.9=30271, 99.99=36255] 
2026-04-17 00:30:20:957 260 sec: 2237419 operations; 15115.11 current ops/sec; est completion in 1 minute [READ: Count=28217, Max=57663, Min=26, Avg=2781.53, 90=3583, 99=11663, 99.9=23535, 99.99=50079] [READ-FAILED: Count=17279, Max=57087, Min=50, Avg=2764.34, 90=3557, 99=11631, 99.9=22639, 99.99=48319] [UPDATE: Count=90777, Max=58431, Min=76, Avg=2943.58, 90=3763, 99=11991, 99.9=24479, 99.99=57407] [INSERT: Count=14862, Max=63679, Min=511, Avg=5790.75, 90=6963, 99=24303, 99.9=38719, 99.99=63615] 
2026-04-17 00:30:30:957 270 sec: 2398918 operations; 16149.9 current ops/sec; est completion in 1 minute [READ: Count=29762, Max=40447, Min=265, Avg=2602.16, 90=3213, 99=10823, 99.9=22719, 99.99=38239] [READ-FAILED: Count=18690, Max=38367, Min=29, Avg=2577.79, 90=3185, 99=10639, 99.9=23167, 99.99=34175] [UPDATE: Count=97006, Max=42143, Min=133, Avg=2762.67, 90=3383, 99=12063, 99.9=23167, 99.99=38367] [INSERT: Count=16041, Max=44511, Min=2080, Avg=5362.95, 90=6199, 99=23391, 99.9=30703, 99.99=43263] 
2026-04-17 00:30:40:957 280 sec: 2562612 operations; 16369.4 current ops/sec; est completion in 48 seconds [READ: Count=30071, Max=30175, Min=34, Avg=2577.88, 90=3253, 99=10383, 99.9=22207, 99.99=24847] [READ-FAILED: Count=19144, Max=25119, Min=150, Avg=2523.29, 90=3187, 99=9799, 99.9=22223, 99.99=24815] [UPDATE: Count=98030, Max=30015, Min=111, Avg=2717.8, 90=3375, 99=10815, 99.9=22287, 99.99=25071] [INSERT: Count=16442, Max=50591, Min=1705, Avg=5318.93, 90=6175, 99=22911, 99.9=32255, 99.99=41471] 
2026-04-17 00:30:50:957 290 sec: 2722959 operations; 16034.7 current ops/sec; est completion in 30 seconds [READ: Count=29445, Max=50943, Min=76, Avg=2609.31, 90=3289, 99=10383, 99.9=21759, 99.99=45983] [READ-FAILED: Count=18821, Max=57119, Min=29, Avg=2593.66, 90=3235, 99=10607, 99.9=21647, 99.99=55743] [UPDATE: Count=96086, Max=56927, Min=185, Avg=2780.62, 90=3465, 99=11207, 99.9=22047, 99.99=55071] [INSERT: Count=15995, Max=59839, Min=1434, Avg=5430.76, 90=6371, 99=21951, 99.9=45023, 99.99=56895] 
2026-04-17 00:31:00:957 300 sec: 2885333 operations; 16237.4 current ops/sec; est completion in 12 seconds [READ: Count=29531, Max=26143, Min=148, Avg=2573, 90=3263, 99=10519, 99.9=22559, 99.99=25903] [READ-FAILED: Count=19238, Max=28895, Min=31, Avg=2564.26, 90=3265, 99=10671, 99.9=22527, 99.99=28655] [UPDATE: Count=97654, Max=30607, Min=147, Avg=2751.24, 90=3445, 99=11655, 99.9=23023, 99.99=26063] [INSERT: Count=15969, Max=38463, Min=958, Avg=5369.71, 90=6339, 99=22255, 99.9=30175, 99.99=37343] 
2026-04-17 00:31:08:004 307 sec: 3000000 operations; 16271.75 current ops/sec; [READ: Count=20911, Max=23343, Min=33, Avg=2438.35, 90=3049, 99=9855, 99.9=21999, 99.99=23295] [CLEANUP: Count=48, Max=1786, Min=42, Avg=109.46, 90=102, 99=1786, 99.9=1786, 99.99=1786] [READ-FAILED: Count=13615, Max=23263, Min=24, Avg=2418.29, 90=3021, 99=9951, 99.9=21999, 99.99=23263] [UPDATE: Count=68908, Max=23359, Min=75, Avg=2602.77, 90=3207, 99=10871, 99.9=21999, 99.99=23215] [INSERT: Count=11172, Max=34111, Min=111, Avg=5068.01, 90=5923, 99=20991, 99.9=26927, 99.99=32799] 
[OVERALL], RunTime(ms), 307046
[OVERALL], Throughput(ops/sec), 9770.522983526898
[TOTAL_GCS_G1_Young_Generation], Count, 865
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 1529
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.4979709880604209
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 865
[TOTAL_GC_TIME], Time(ms), 1529
[TOTAL_GC_TIME_%], Time(%), 0.4979709880604209
[READ], Operations, 535223
[READ], AverageLatency(us), 4173.205671280943
[READ], MinLatency(us), 26
[READ], MaxLatency(us), 275199
[READ], 95thPercentileLatency(us), 9431
[READ], 99thPercentileLatency(us), 19119
[READ], Return=OK, 535223
[READ], Return=ERROR, 365440
[CLEANUP], Operations, 48
[CLEANUP], AverageLatency(us), 109.45833333333333
[CLEANUP], MinLatency(us), 42
[CLEANUP], MaxLatency(us), 1786
[CLEANUP], 95thPercentileLatency(us), 119
[CLEANUP], 99thPercentileLatency(us), 1786
[READ-FAILED], Operations, 365440
[READ-FAILED], AverageLatency(us), 4358.904747701401
[READ-FAILED], MinLatency(us), 24
[READ-FAILED], MaxLatency(us), 275455
[READ-FAILED], 95thPercentileLatency(us), 9767
[READ-FAILED], 99thPercentileLatency(us), 20239
[UPDATE], Operations, 1800911
[UPDATE], AverageLatency(us), 4568.669801006268
[UPDATE], MinLatency(us), 75
[UPDATE], MaxLatency(us), 277247
[UPDATE], 95thPercentileLatency(us), 10167
[UPDATE], 99thPercentileLatency(us), 20975
[UPDATE], Return=OK, 1800911
[INSERT], Operations, 298426
[INSERT], AverageLatency(us), 8836.580127066676
[INSERT], MinLatency(us), 111
[INSERT], MaxLatency(us), 308223
[INSERT], 95thPercentileLatency(us), 18911
[INSERT], 99thPercentileLatency(us), 38143
[INSERT], Return=OK, 298426